In [54]:
import pandas as pd
df = pd.read_csv("p.csv")

In [55]:
df.tail()

    Class  Marks
6    2015     82
7    2016     93
8    2017     92
9    2018     93
10   2019     92

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Class   11 non-null     int64
 1   Marks   11 non-null     int64
dtypes: int64(2)
memory usage: 308.0 bytes

In [57]:
df.dropna()

    Class  Marks
0    2010     87
1    2011     85
2    2012     89
3    2013     89
4    2014     86
5    2012     85
6    2015     82
7    2016     93
8    2017     92
9    2018     93
10   2019     92

In [58]:
df1 = df.dropna()

In [59]:
df1

    Class  Marks
0    2010     87
1    2011     85
2    2012     89
3    2013     89
4    2014     86
5    2012     85
6    2015     82
7    2016     93
8    2017     92
9    2018     93
10   2019     92

In [60]:
df.dropna()

    Class  Marks
0    2010     87
1    2011     85
2    2012     89
3    2013     89
4    2014     86
5    2012     85
6    2015     82
7    2016     93
8    2017     92
9    2018     93
10   2019     92

In [61]:
df

    Class  Marks
0    2010     87
1    2011     85
2    2012     89
3    2013     89
4    2014     86
5    2012     85
6    2015     82
7    2016     93
8    2017     92
9    2018     93
10   2019     92

In [62]:
df['Marks'].mean()

88.45454545454545

In [63]:
df['Marks'].median()

89.0

In [64]:
df.describe()

             Class      Marks
count    11.000000  11.000000
mean   2014.272727  88.454545
std       2.969542   3.751363
min    2010.000000  82.000000
25%    2012.000000  85.500000
50%    2014.000000  89.000000
75%    2016.500000  92.000000
max    2019.000000  93.000000

In [65]:
df['Marks'].mode()

0    85
1    89
2    92
3    93
Name: Marks, dtype: int64

In [66]:
df['Marks'].fillna(df['Marks'].median())

0     87
1     85
2     89
3     89
4     86
5     85
6     82
7     93
8     92
9     93
10    92
Name: Marks, dtype: int64

In [67]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [68]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool